              05 #-MATRIX-ROW OCCURS 100 INDEXED BY #-I-ROW.
                 10 #-MATRIX-CLM OCCURS 100 INDEXED BY #-I-COL.
                    15 #-MATRIX-VALUE            PIC S999V9(10) COMP-3.
